app/controllers/facts_controller.rb

    def index
      # @facts = Fact.all.order('created_at DESC')
      @facts = Fact.page(params[:page]).per(10).order('created_at DESC')
---
SELECT  "facts".* FROM "facts"  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "facts"

    def create
      @fact = Fact.new(fact_params)
      @fact.user = current_user
      @fact.save
---
INSERT INTO "facts" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Kitties are awesome."], ["created_at", "2016-02-13 20:03:29.710448"], ["updated_at", "2016-02-13 20:03:29.710448"]]

    def show
      @fact = Fact.find(params[:id])
---
SELECT  "facts".* FROM "facts" WHERE "facts"."id" = $1 LIMIT 1  [["id", 1]]

    def edit
      @fact = Fact.find(params[:id])
---
SELECT  "facts".* FROM "facts" WHERE "facts"."id" = $1 LIMIT 1  [["id", 6]]

    def update
      @fact = Fact.find(params[:id])

      if @fact.update(fact_params)
---
SELECT  "facts".* FROM "facts" WHERE "facts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "facts" SET "body" = $1, "updated_at" = $2 WHERE "facts"."id" = $3  [["body", "ActiveModel::ForbiddenAttributesError"], ["updated_at", "2016-02-14 22:17:58.566054"], ["id", 6]]