app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "mango1"], ["email", "mango1@mango.mango"], ["password_hash", "mango"], ["created_at", "2016-02-13 21:39:40.517132"], ["updated_at", "2016-02-13 21:39:40.517132"]]